#
# a='hello'
# print(a[-1:-5:-1])
#
# print('一---------------------------------------------------------------')
#
# b='hello'
# print(b.split('e'))
#
# print('二---------------------------------------------------------------')
#
# c='hello'
# print(len(c))
#
# print('三---------------------------------------------------------------')
#
# d_1='hello'
# d_2='goodday'
# print(d_1+d_2)
# print(d_1,d_2)
#
# print('四---------------------------------------------------------------')


# age=18
# name='小恒星'
# print('{},今年{}岁'.format(name,age))
#
#
# print('五----------------------------------------------------------------')

# #增加：
# f=['hello',123]
# f.insert(1,'goodday')
# print(f)
#

# #删除：
# g=['hello',123]
# g.pop(1)
# print(g)
#
#
# #列表、元组可以用下标取值，但字典不行：
# h={"name":"jack",
#    "age":18,
#    "class":[18,"aaa","中文"]
#    }
#
#
# h['class']
# print(h)
#
#
# #字典中新增(取一个没有的值就是新增)
# h["key"]="value"
# print(h)
# print(type(h['age']))
#
#
#验证是偶数还是基数
i = 4

if i%2 ==0:                  #如果i除以2可以整除，那么i就是偶数
        print('i是偶数')
elif i%2 !=0:                #如果i除以2可以整除，那么i就不是偶数
    print('i不是偶数')

# 验证是偶数还是基数
    i = int(input("请输入数字"))

    if i % 2 == 0:  # 如果i除以2可以整除，那么i就是偶数
        print('i是偶数')
    elif i % 2 != 0:  # 如果i除以2可以整除，那么i就不是偶数
        print('i不是偶数')